MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K40/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF26K40_H_
#define _PIC18LF26K40_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18LF26K40
 */
#ifndef _XC_H_
#warning Header file pic18lf26k40.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0xE8D);
#ifndef _LIB_BUILD
asm("RX2PPS equ 0E8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RXPPS                  :5;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0xE8D);
// bitfield macros
#define _RX2PPS_PIN_POSN                                    0x0
#define _RX2PPS_PIN_POSITION                                0x0
#define _RX2PPS_PIN_SIZE                                    0x3
#define _RX2PPS_PIN_LENGTH                                  0x3
#define _RX2PPS_PIN_MASK                                    0x7
#define _RX2PPS_PORT_POSN                                   0x3
#define _RX2PPS_PORT_POSITION                               0x3
#define _RX2PPS_PORT_SIZE                                   0x2
#define _RX2PPS_PORT_LENGTH                                 0x2
#define _RX2PPS_PORT_MASK                                   0x18
#define _RX2PPS_RXPPS_POSN                                  0x0
#define _RX2PPS_RXPPS_POSITION                              0x0
#define _RX2PPS_RXPPS_SIZE                                  0x5
#define _RX2PPS_RXPPS_LENGTH                                0x5
#define _RX2PPS_RXPPS_MASK                                  0x1F

// Register: CK2PPS
#define CK2PPS CK2PPS
extern volatile unsigned char           CK2PPS              __at(0xE8E);
#ifndef _LIB_BUILD
asm("CK2PPS equ 0E8Eh");
#endif
// aliases
extern volatile unsigned char           TX2PPS              __at(0xE8E);
#ifndef _LIB_BUILD
asm("TX2PPS equ 0E8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS                  :5;
    };
} CK2PPSbits_t;
extern volatile CK2PPSbits_t CK2PPSbits __at(0xE8E);
// bitfield macros
#define _CK2PPS_PIN_POSN                                    0x0
#define _CK2PPS_PIN_POSITION                                0x0
#define _CK2PPS_PIN_SIZE                                    0x3
#define _CK2PPS_PIN_LENGTH                                  0x3
#define _CK2PPS_PIN_MASK                                    0x7
#define _CK2PPS_PORT_POSN                                   0x3
#define _CK2PPS_PORT_POSITION                               0x3
#define _CK2PPS_PORT_SIZE                                   0x2
#define _CK2PPS_PORT_LENGTH                                 0x2
#define _CK2PPS_PORT_MASK                                   0x18
#define _CK2PPS_TXPPS_POSN                                  0x0
#define _CK2PPS_TXPPS_POSITION                              0x0
#define _CK2PPS_TXPPS_SIZE                                  0x5
#define _CK2PPS_TXPPS_LENGTH                                0x5
#define _CK2PPS_TXPPS_MASK                                  0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS                  :5;
    };
} TX2PPSbits_t;
extern volatile TX2PPSbits_t TX2PPSbits __at(0xE8E);
// bitfield macros
#define _TX2PPS_PIN_POSN                                    0x0
#define _TX2PPS_PIN_POSITION                                0x0
#define _TX2PPS_PIN_SIZE                                    0x3
#define _TX2PPS_PIN_LENGTH                                  0x3
#define _TX2PPS_PIN_MASK                                    0x7
#define _TX2PPS_PORT_POSN                                   0x3
#define _TX2PPS_PORT_POSITION                               0x3
#define _TX2PPS_PORT_SIZE                                   0x2
#define _TX2PPS_PORT_LENGTH                                 0x2
#define _TX2PPS_PORT_MASK                                   0x18
#define _TX2PPS_TXPPS_POSN                                  0x0
#define _TX2PPS_TXPPS_POSITION                              0x0
#define _TX2PPS_TXPPS_SIZE                                  0x5
#define _TX2PPS_TXPPS_LENGTH                                0x5
#define _TX2PPS_TXPPS_MASK                                  0x1F

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
extern volatile unsigned char           SSP2CLKPPS          __at(0xE8F);
#ifndef _LIB_BUILD
asm("SSP2CLKPPS equ 0E8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPCLKPPS              :5;
    };
} SSP2CLKPPSbits_t;
extern volatile SSP2CLKPPSbits_t SSP2CLKPPSbits __at(0xE8F);
// bitfield macros
#define _SSP2CLKPPS_PIN_POSN                                0x0
#define _SSP2CLKPPS_PIN_POSITION                            0x0
#define _SSP2CLKPPS_PIN_SIZE                                0x3
#define _SSP2CLKPPS_PIN_LENGTH                              0x3
#define _SSP2CLKPPS_PIN_MASK                                0x7
#define _SSP2CLKPPS_PORT_POSN                               0x3
#define _SSP2CLKPPS_PORT_POSITION                           0x3
#define _SSP2CLKPPS_PORT_SIZE                               0x2
#define _SSP2CLKPPS_PORT_LENGTH                             0x2
#define _SSP2CLKPPS_PORT_MASK                               0x18
#define _SSP2CLKPPS_SSPCLKPPS_POSN                          0x0
#define _SSP2CLKPPS_SSPCLKPPS_POSITION                      0x0
#define _SSP2CLKPPS_SSPCLKPPS_SIZE                          0x5
#define _SSP2CLKPPS_SSPCLKPPS_LENGTH                        0x5
#define _SSP2CLKPPS_SSPCLKPPS_MASK                          0x1F

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
extern volatile unsigned char           SSP2DATPPS          __at(0xE90);
#ifndef _LIB_BUILD
asm("SSP2DATPPS equ 0E90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPDATPPS              :5;
    };
} SSP2DATPPSbits_t;
extern volatile SSP2DATPPSbits_t SSP2DATPPSbits __at(0xE90);
// bitfield macros
#define _SSP2DATPPS_PIN_POSN                                0x0
#define _SSP2DATPPS_PIN_POSITION                            0x0
#define _SSP2DATPPS_PIN_SIZE                                0x3
#define _SSP2DATPPS_PIN_LENGTH                              0x3
#define _SSP2DATPPS_PIN_MASK                                0x7
#define _SSP2DATPPS_PORT_POSN                               0x3
#define _SSP2DATPPS_PORT_POSITION                           0x3
#define _SSP2DATPPS_PORT_SIZE                               0x2
#define _SSP2DATPPS_PORT_LENGTH                             0x2
#define _SSP2DATPPS_PORT_MASK                               0x18
#define _SSP2DATPPS_SSPDATPPS_POSN                          0x0
#define _SSP2DATPPS_SSPDATPPS_POSITION                      0x0
#define _SSP2DATPPS_SSPDATPPS_SIZE                          0x5
#define _SSP2DATPPS_SSPDATPPS_LENGTH                        0x5
#define _SSP2DATPPS_SSPDATPPS_MASK                          0x1F

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
extern volatile unsigned char           SSP2SSPPS           __at(0xE91);
#ifndef _LIB_BUILD
asm("SSP2SSPPS equ 0E91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPSSPPS               :5;
    };
} SSP2SSPPSbits_t;
